import chair1 from "../../Images/chair1.jpg";
import chair1s from "../../Images/chair1s.jpeg";
import chair1_2 from "../../Images/chair1_2.jpeg";
import chair1_3 from "../../Images/chair1_3.jpeg";
import chair2 from "../../Images/chair2.jpg";
import chair2s from "../../Images/chair2s.jpg";
import chair2_2 from "../../Images/chair2_2.png";
import chair2_3 from "../../Images/chair2_3.png";
import closet1 from "../../Images/closet1.jpeg";
import closet1s from "../../Images/closet1s.jpeg";
import closet1_2 from "../../Images/closet1_2.jpeg";
import closet1_3 from "../../Images/closet1_3.jpeg";
import bed1 from "../../Images/bed1.jpeg";
import bed1s from "../../Images/bed1s.jpeg";
import bed1_1 from "../../Images/bed1_1.jpg";
import bed1_2 from "../../Images/bed1_2.jpg";
import puf1 from "../../Images/puf1.jpg";
import puf1s from "../../Images/puf1s.jpg";
import puf1_2 from "../../Images/puf1_2.jpg";
import puf1_3 from "../../Images/puf1_3.jpg";
import stol1 from "../../Images/stol1.png";
import stol1s from "../../Images/stol1s.jpeg";
import stol1_2 from "../../Images/stol1_2.jpeg";
import stol1_3 from "../../Images/stol1_3.jpeg";

const products = [
    {
        id: 1,
        name: "Крісло обертове COCO II від польського виробника Signal",
        image: chair1,
        hoverImage: chair1s,
        image2: chair1_2,
        image3: chair1_3,
        price: "5 095.00 грн",
        category: "Стільці",
        description:
            "Стильний стілець з поворотним сидінням для їдальні Крісло Coco II Vardo – це унікальна пропозиція для вітальні та їдальні, оформлених у сучасному стилі лофт. Зручне крісло легке, просте в догляді та елегантне. Сидіння повертається на 180 градусів – завдяки спеціальному механізму крісло повертається у вихідне положення.",
        additionalInfo: (
            <>
                Ніжки поворотного крісла виготовлені з металу найвищої якості,
                максимальне навантаження на крісло 120 кг. Оббивка крісла
                виконана з приємної на дотик тканини, стійкої до забруднень і
                пошкоджень.
                <br />
                <br />
                Матеріал: тканина Vardo 66/метал
                <br />
                Колір: каррі/матовий чорний
                <br />
                <br />
                Розміри:
                <br />
                висота стільця: 87 см
                <br />
                глибина сидіння: 45 см
                <br />
                ширина сидіння: 60 см
                <br />
                висота сидіння: 48 см
                <br />
                максимальне навантаження: 120 кг
                <br />
                <br />
                Особливості продукту:
                <br />
                м’яке зручне крісло для вітальні
                <br />
                Напівповоротне сидіння на 180 градусів
                <br />
                міцна металева основа
                <br />
                для самостійного складання
            </>
        ),
        material: "Дерево",
        weight: "5.5 кг",
        width: "60 см",
        height: "85 см",
        length: "60 см",
        country: "Польща",
    },

    {
        id: 2,
        name: "Стілець кухонний Alfa в супер якісній тканині польського виробника",
        image: chair2,
        hoverImage: chair2s,
        image2: chair2_2,
        image3: chair2_3,
        price: "3 954.00 грн",
        category: "Стільці",
        description:
            "Він стане чудовим доповненням стильної їдальні, а також залу очікування, готельного номера і навіть вітальні або робочого куточка.",
        additionalInfo:
            "Стілець Alfa – гарний стілець, який відмінно впишеться в любий інтерєр кімнати, стилізований під сучасний і стильний.У нього чудові, вузькі чотири ніжки, які надають йому легкості, він зроблений із металу. Дуже просте, плоске сидіння оточене спинкою і злегка опущеними  та привідкритими підлокітниками, через що крісло здається глибоким. Стілець повністю оббитий красивою тканиною, з витонченими швами всередині . Завдяки цьому крісло набуває сучасного та ефектного характеру.  Безумовно, він не набридне за короткий час, дозволить вписатися в будь-який, зі смаком, оформлений інтер’єр і принесе вам задоволення від його погляду.",
        country: "Польша",
        material: "Дерево",
        weight: "3.5 кг",
        width: "85 см",
        height: "59 см",
        length: "45 см",
    },
    {
        id: 3,
        name: "Шафа-купе Zegna, сучасна стильна шафа, розміром 220 см ширина",
        image: closet1,
        hoverImage: closet1s,
        image2: closet1_2,
        image3: closet1_3,
        price: "13 579.00 грн",
        category: "Шафи",
        description:
            "М’які та затишні  відтінки додають затишку та створюють атмосферу релаксу Естетичний та натуральний вигляд меблів забезпечує використання високоякісної дерево-стружкової плити, що проходить ретельну перевірку на виробництві. Ми подбали про те, щоб меблі були не тільки привабливими зовні, але й зручними та комфортними у користуванні.",
        additionalInfo: (
            <>
                Шафа-купе Zegna
                <br />
                <br />
                Опис: Стильна та функціональна шафа-купе Zegna стане ідеальним
                доповненням вашого інтер’єру.
                <br />
                Виготовлена з високоякісних матеріалів, вона забезпечить
                тривалий термін служби та привабливий зовнішній вигляд.
                <br />
                <br />
                Корпус: ДСП товщиною 16 мм
                <br />
                Фасад: ДСП товщиною 16 мм та дзеркальна одна дверка
                <br />
                Система: Підвісна розсувна система, що забезпечує легкість та
                зручність у користуванні
                <br />
                <br />
                Розміри:
                <br />
                Ширина: 150 см
                <br />
                Висота: 204,5 см
                <br />
                Глибина: 58,1 см
                <br />
                <br />
                Опції для дозамовлення:
                <br />
                - Механізм тихого закривання дверей, артикул: AC.ST.SM
                <br />
                - Комплект полиць 3 шт
                <br />
                <br />
                Переваги:
                <br />
                - Дзеркальна дверка додає візуальної просторовості та освітлення
                кімнаті
                <br />
                - Підвісна розсувна система забезпечує тихе та плавне
                відкривання/закривання дверей
                <br />
                - Якісні матеріали гарантують довговічність та стійкість до
                зношування
                <br />- Додаткові опції дозволяють налаштувати шафу під ваші
                потреби
            </>
        ),
        country: "Україна",
        material: "Плита ламінована",
        weight: "94 кг",
        width: "150 см",
        height: "204 см",
        length: "59 см",
    },
    {
        id: 4,
        name: "Ліжко двоспальне Signal MARANI II VELVET 160х200",
        image: bed1,
        hoverImage: bed1s,
        image2: bed1_1,
        image3: bed1_2,
        price: "20 765.00 грн",
        category: "Ліжка",
        description:
            "Signal MARANI II VELVET – це вишукане та стильне рішення для вашої спальні. Виконане в сучасному дизайні, воно поєднує елегантність та комфорт. М’яке оббивне покриття з велюру додає розкоші, а зручна висота спального місця забезпечує легкість підйому та посадки.",
        additionalInfo: (
            <>
                Ліжко двоспальне Signal MARANI II VELVET — це стильне та
                елегантне рішення для вашої спальні.
                <br />
                Виконане з високоякісних матеріалів, це ліжко пропонує комфорт і
                сучасний дизайн.
                <br />
                Оббивка з м'якого велюру додає розкоші, а кольорова палітра
                дозволяє легко вписати його в будь-який інтер'єр.
                <br />
                <br />
                Розмір матраца: 160x200 см забезпечує достатньо простору для
                комфортного сну.
                <br />
                Зручна спинка запрошує до відпочинку, а міцна конструкція
                гарантує довговічність та стабільність.
                <br />
                Ліжко також оснащене ящиками для зберігання, що допоможе
                зберегти порядок у вашій спальні.
                <br />
                <br />
                Обираючи ліжко Signal MARANI II VELVET, ви отримуєте не лише
                предмет меблів, а й стильний акцент у вашій оселі.
            </>
        ),
        country: "Польша",
        material: "Дерево",
        weight: "113 кг",
        width: "170 см",
        height: "116 см",
        length: "210 см",
    },
    {
        id: 5,
        name: "Пуф OSLO, в супер якісній велюровій тканині Букле, польського виробництва",
        image: puf1,
        hoverImage: puf1s,
        image2: puf1_2,
        image3: puf1_3,
        price: "3 526.00 грн",
        category: "Пуфи",
        description:
            "Пуфи – це не лише стильний декор, а й функціональні елементи меблів. Вони вражають своєю компактністю та можливістю використання як додаткового сидіння, ніжки для відпочинку чи столика для традиційного вечора з книгою та чашкою чаю.",
        additionalInfo: (
            <>
                Ласкаво просимо в світ затишку та стилю, де ваш будинок стає
                справжнім інтер’єрним шедевром.
                <br />
                Запрошуємо вас відкрити для себе колекцію пуфів та бенкеток,
                створених з використанням високоякісних матеріалів – тканини та
                велюру. Дозвольте собі обрати той, який стане найкращим
                доповненням для вашого дому, враховуючи ваші особистість і
                потреби.
                <br />
                <br />
                Наші пуфи та бенкетки виготовлені з тканини та велюру, які
                відзначаються не лише естетикою, але й високою міцністю та
                комфортом.
                <br />
                Тканина додає натуральності та легкості, в той час як велюр
                вражає своєю ніжністю та вишуканістю.
                <br />
                Наші пуфи та бенкетки – це справжні шедеври дизайну. Вони
                додають не тільки функціональності, але і вишуканості вашому
                простору.
                <br />
                Чудовий вибір форм, кольорів і текстур дозволяє вам знайти
                ідеальний варіант для кожного куточка вашого дому.
                <br />
                <br />
                Турбота про ваші меблі – це наш пріоритет.
                <br />
                Тканина та велюр легко чистяться, забезпечуючи тривалу якість та
                стиль вашого інтер’єру.
                <br />
                <br />
                Ми віримо, що стильний та комфортний дизайн не повинен бути
                недосяжним.
                <br />
                Тому наші пуфи та бенкетки пропонують вам високу якість за
                розумною ціною.
                <br />
                Наша головна мета – ваша повна задоволеність від покупки.
                <br />
                Ми гарантуємо високу якість, зручність та довговічність кожного
                нашого товару.
                <br />
                Якщо ви не задоволені, ми готові знайти рішення.
                <br />
                <br />
                Створіть свій власний унікальний простір з нашими пуфами та
                бенкетками з тканини та велюру.
                <br />
                Обирайте стиль, комфорт і високу якість разом із нами!
            </>
        ),
        country: "Польша",
        material: "Букле, велюр",
        weight: "4 кг",
        width: "42 см",
        height: "47 см",
        length: "42 см",
    },
    {
        id: 6,
        name: "Комп’ютерний стіл CT140, польсикй стильний стіл в стилі loft",
        image: stol1,
        hoverImage: stol1s,
        image2: stol1_2,
        image3: stol1_3,
        price: "1 623.00 грн",
        category: "Столи",
        description:
            "Стіл СТ140 – це стильний письмовий стіл вражає елегантним дизайном та функціональністю. Зроблений з металу, він поєднує сучасні лінії і практичний підхід до організації простору. Ідеально підходить для роботи чи навчання, надаючи зручність та стиль вашому робочому оточенню.",
        additionalInfo: (
            <>
                Стіл СТ140 – ідеально підійде для інтер’єру стилю Лофт, проте
                для креативних людей меж не існує, тому можна сміливо
                експериментувати.
                <br />
                <br />
                Усі матеріали екологічно чисті та безпечні.
                <br />
                Роль опор у столі виконує конструкція з чорного металу, яка
                витримує великі навантаження, що забезпечить надійність та
                довговічність конструкцій.
                <br />
                <br />
                Прості, але стильні форми та нейтральні кольори роблять цей стіл
                зрозумілим та максимально комфортним для користувача.
                <br />
                Доступність даної продукції стане надприємним бонусом для
                гаманця.
                <br />
                Естетика у простоті!
                <br />
                <br />
                Меблі доставляються в надійному фабричному пакуванні, в
                розібраному вигляді.
                <br />
                До комплекту постачання входить вся необхідна фурнітура й
                інструкції для складання.
                <br />
                Всі основні технологічні отвори просвердлені, тому збирання
                виробу не становитиме труднощів.
            </>
        ),
        country: "Польша",
        material: "Дерево, метал",
        weight: "15 кг",
        width: "90 см",
        height: "85 см",
        length: "50 см",
    },
];

export default products;
