const texts = [
    {
        title: "Driftwood",
        description:
            "Створіть затишний дім з нашими унікальними та стильними меблями!",
    },
    {
        title: "Чому ми ?",
        description:
            "Ми слідкуємо за новими тенденціями, пропонуючи актуальні рішення.",
    },
    {
        title: "Driftwood",
        description:
            "Затишок і стиль, ідеальні меблі для вашого дому і родини завжди!",
    },
    {
        title: "Хто ми ?",
        description:
            "Наша команда допомагає клієнтам створювати комфортні інтер'єри.",
    },
    {
        title: "Driftwood",
        description:
            "Доступні меблі для будь-якого стилю – створіть простір своєї мрії!",
    },
];

export default texts;
